[
    {
      "title": "Painel de Gerenciamento de Prontuários",
      "describe": "Uma aplicação que fornece funcionalidades que ajudam médicos a ter uma maior controle de prontuários/atestados de seus pacientes",
      "describeDetail": "O objetivo deste projeto é oferecer funcionalidades que possam facilitar o gerenciamento de dados médicos, uma ideia surgiu que durante uma conversa informal com um amigo médico, que expressou a necessidade urgente de um sistema que lhe ajudasse de uma forma organizacional e dinâmica.",
      "imagePath": "/project_medical_control.jpg",
      "languages": ["TypeScript", "MUI", "NodeJS", "Google Cloud"],
      "linkApplication": "https://medical-control-app.vercel.app/"
    },
    {
      "title": "Sotware Educacional",
      "describe": "Um software que torna visível o entendimento do fenômeno de transferência de carga da eletrodinâmica.",
      "describeDetail": "Software criado com o Python como projeto final de uma disciplina de Física durante a minha graduação. Projeto interdisciplinar que eu idealizei com o intuito de entregar o projeto final e estudar programação ao mesmo tempo.",
      "imagePath": "/project-sotware-educacional.jpg",
      "languages": ["Python"],
      "linkApplication": "https://github.com/JoaoNogueira23/ProjectsPython/tree/main/SimulationOfPhisical"
    },
    {
      "title": "Web Scraping",
      "describe": "Extração de notícias sobre futebol",
      "describeDetail": "Projeto criado com o intuito de treinar a utilização de recursos da AWS, além da utilização de algoritmos de RPA.",
      "imagePath": "/project_soccer_cortada.JPEG",
      "languages": ["Python", "AWS", "MySQL"],
      "linkApplication": "https://github.com/JoaoNogueira23/news-scraping"
    },
    {
      "title": "Contador de frequência",
      "describe": "Gerenciador de frequência de indivíduos durante um período de aulas ou afins.",
      "describeDetail": "Projeto desenvolvido com o intuito de gerenciar as minhas faltas nas disciplinas durante os semestres na faculdade, um algoritmo desenvolvido tanto para suprir uma necessidade minha e de amigos quanto para treinar minhas habilidades com o Python. Ele gera um relatório em Excel como feedback para o usuário.",
      "imagePath": "/project_frequencia.jpg",
      "languages": ["Python", "Excel"],
      "linkApplication": "https://github.com/JoaoNogueira23/ProjectsPython/tree/main/ContadorFrequencia"
    }
]
  